In [1]:
import numpy as np
matrix = np.arange(10,dtype=float) # Reshaping
matrix = matrix.reshape(5,2)
matrix

array([[0., 1.],
       [2., 3.],
       [4., 5.],
       [6., 7.],
       [8., 9.]])

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [9]:
cols = ["name","age","gender","job"]
cols

['name', 'age', 'gender', 'job']

In [10]:
user1 = pd.DataFrame([["alice",19,"f","student"],["john",26,"m","student"]],columns = cols)
user1

    name  age gender      job
0  alice   19      f  student
1   john   26      m  student

In [11]:
user2 = pd.DataFrame([["eric",22,"m","student"],["paul",58,"f","manager"]],columns = cols)
user2

   name  age gender      job
0  eric   22      m  student
1  paul   58      f  manager

In [12]:
user3 = pd.DataFrame([["jeet",21,"m","worker"],["anish",42,"m","typist"]],columns = cols)
user3

    name  age gender     job
0   jeet   21      m  worker
1  anish   42      m  typist

In [13]:
user4 = pd.DataFrame(dict(name=["peter","julie"],age=[33,44],
                        gender=["m","f"],job=["engineer","scientist"]))
user4

    name  age gender        job
0  peter   33      m   engineer
1  julie   44      f  scientist